app/views/messages/index.html.erb

SELECT  "inboxes".* FROM "inboxes" WHERE "inboxes"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."inbox_id" = ?  [["inbox_id", 1]]
---
  <% end %>
  <% User.current.inbox.messages.each do |message| %>

SELECT  "outboxes".* FROM "outboxes" WHERE "outboxes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
        <p class="media-body pb-3 mb-0 small lh-125 border-bottom border-gray">
          <strong class="d-block text-gray-dark"><%= message.outbox.user.first_name %> <%= message.outbox.user.last_name %></strong>