app/controllers/messages_controller.rb

  def show
    @message = Message.find(params[:id])
    # render json: @message
    if @message.read == false
      @message.decrement_unread_messages
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "messages" SET "read" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["read", "t"], ["updated_at", "2020-02-23 10:23:33.093366"], ["id", 1]]

  def create
    old_message = Message.find_by(id: params[:reply]) if params[:reply].present?
    @message = Message.new(message_params)
    @message.outbox = Outbox.find_by(user_id: User.current)
    @message.inbox = if old_message.created_at < 7.days.ago
                       Inbox.find_by(user_id: User.default_admin)
                     else
                       Inbox.find_by(user_id: User.default_doctor)
                     end
    if @message.save
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "outboxes".* FROM "outboxes" WHERE "outboxes"."user_id" = 1 LIMIT ?  [["LIMIT", 1]]
INSERT INTO "messages" ("body", "outbox_id", "inbox_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "qwewqewqewq"], ["outbox_id", 1], ["inbox_id", 3], ["created_at", "2020-02-22 16:29:23.421235"], ["updated_at", "2020-02-22 16:29:23.421235"]]
SELECT  "inboxes".* FROM "inboxes" WHERE "inboxes"."user_id" = 3 LIMIT ?  [["LIMIT", 1]]
UPDATE "inboxes" SET "unread_messages" = ? WHERE "inboxes"."id" = ?  [["unread_messages", 1], ["id", 2]]