app/controllers/payments_controller.rb

SELECT  "inboxes".* FROM "inboxes" WHERE "inboxes"."user_id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
  def create
    @message = Message.create(body: "I've lost my script, please issue a new one at a charge of €10", outbox: Outbox.find_by(user_id: params[:user_id]), inbox: Inbox.find_by(user_id: User.default_admin))