app/controllers/payments_controller.rb

INSERT INTO "messages" ("body", "outbox_id", "inbox_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
SELECT  "inboxes".* FROM "inboxes" WHERE "inboxes"."user_id" = 3 LIMIT ?  [["LIMIT", 1]]
SELECT  "outboxes".* FROM "outboxes" WHERE "outboxes"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
INSERT INTO "payments" ("user_id") VALUES (?)  [["user_id", 1]]
---
  def create
    @message = Message.create(body: "I've lost my script, please issue a new one at a charge of €10", outbox: Outbox.find_by(user_id: params[:user_id]), inbox: Inbox.find_by(user_id: User.default_admin))
    PaymentProviderFactory.provider.debit_card(User.current)
    @payment = Payment.create(user_id: params[:user_id])